app/controllers/users_controller.rb

  def index #show all user GET
    @user = User.all
---
SELECT "users".* FROM "users"